
# 给你 k 枚相同的鸡蛋，并可以使用一栋从第 1 层到第 n 层共有 n 层楼的建筑。
# 
#  已知存在楼层 f ，满足 0 <= f <= n ，任何从 高于 f 的楼层落下的鸡蛋都会碎，从 f 楼层或比它低的楼层落下的鸡蛋都不会破。 
# 
#  每次操作，你可以取一枚没有碎的鸡蛋并把它从任一楼层 x 扔下（满足 1 <= x <= n）。如果鸡蛋碎了，你就不能再次使用它。如果某枚鸡蛋扔下后没有摔碎
# ，则可以在之后的操作中 重复使用 这枚鸡蛋。 
# 
#  请你计算并返回要确定 f 确切的值 的 最小操作次数 是多少？ 
# 
#  示例 1： 
# 
#  
# 输入：k = 1, n = 2
# 输出：2
# 解释：
# 鸡蛋从 1 楼掉落。如果它碎了，肯定能得出 f = 0 。 
# 否则，鸡蛋从 2 楼掉落。如果它碎了，肯定能得出 f = 1 。 
# 如果它没碎，那么肯定能得出 f = 2 。 
# 因此，在最坏的情况下我们需要移动 2 次以确定 f 是多少。 
#  
# 
#  示例 2： 
# 
#  
# 输入：k = 2, n = 6
# 输出：3
#  
# 
#  示例 3： 
# 
#  
# 输入：k = 3, n = 14
# 输出：4
#  
# 
#  
# 
#  提示： 
# 
#  
#  1 <= k <= 100 
#  1 <= n <= 10⁴ 
#  
# 
#  Related Topics 数学 二分查找 动态规划 👍 1004 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
class Solution:
    def superEggDrop(self, k: int, n: int) -> int:
        """李永乐老师讲解写法，逻辑没问题，但是superEggDrop(4, 5000))会超时
        Mi(n,k) = max(M(i,k-1), M(n-i,k)) + 1
        M(n,k) = min(M1,M2,...Mn)
        """
        # if n >= 5000:
        #     return 5000
        #  dp[i][j]表示共i层楼j个鸡蛋时最少要试几次保证能找到临界点
        dp = [[0] * (k + 1) for _ in range(n + 1)]
        for i in range(1, n + 1):
            # 鸡蛋数量为1时，只能一层层从低到高去试，所以共i次
            dp[i][1] = i
            for j in range(2, k + 1):
                dp[i][j] = n  # 最大也就n次
                for h in range(1, i + 1):
                    Mh = max(dp[h - 1][j - 1], dp[i - h][j]) + 1
                    dp[i][j] = min(dp[i][j], Mh)
                if dp[i][k] >= n:
                    dp[i][k] = i
                    break
        # return dp[i][j]
        return dp[n][k]

    def superEggDrop2(self, k: int, n: int) -> int:
        """官方题解方法3：数学法"""
        if n == 1:
            return 1
        f = [[0] * (k + 1) for _ in range(n + 1)]
        for i in range(1, k + 1):
            f[1][i] = 1
        ans = -1
        for i in range(2, n + 1):
            for j in range(1, k + 1):
                f[i][j] = 1 + f[i - 1][j - 1] + f[i - 1][j]
            if f[i][k] >= n:
                ans = i
                break
        return ans


print(Solution().superEggDrop(2, 6))  # 3
print(Solution().superEggDrop(1, 2))  # 2
print(Solution().superEggDrop(3, 14))  # 4
print(Solution().superEggDrop(2, 3))  # 2
print(Solution().superEggDrop(4, 5000))  # 19
print(Solution().superEggDrop2(4, 5000))  # 19
# leetcode submit region end(Prohibit modification and deletion)
